app/Models/FilmModel.php

SELECT *
FROM `film`
---
        public function getAllData()
        {
            // ketika bagian ini dipanggil maka akan ada respon yang diberikan
            return $this ->findAll();