app/Models/GenreModel.php

public function getAllData()
{
    // ketika bagian ini dipanggil maka akan ada respon yang diberikan
    return $this ->findAll();
---
SELECT *
FROM `genre`